CSI API ETABS v1
cAreaObj.SetSelected Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSelected(
	string Name,
	bool Selected,
	eItemType ItemType = eItemType.Objects
)
Function SetSelected (
	Name As String,
	Selected As Boolean,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim Selected As Boolean
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetSelected(Name,
	Selected, ItemType)
int SetSelected(
	String^ Name,
	bool Selected,
	eItemType ItemType = eItemType::Objects
)
abstract SetSelected :
        Name : string *
        Selected : bool *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
Selected
Type: System.Boolean
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace